Repository: KerolosNader69/Ain_ElHayah
Catalog: assets/l10n/app_*.arb
Languages: ar

source: AI-Powered Eye Diagnosis
ar: تشخيص العين بالذكاء الاصطناعي

source: Smart Eye Diagnosis
ar: تشخيص العين الذكي

source: AI Technology
ar: تقنية الذكاء الاصطناعي

# heroDescription
source: Advanced AI models for retinal analysis and eye health assessment. Get instant, accurate eye diagnosis through our cutting-edge technology.
ar: نماذج ذكاء اصطناعي متقدمة لتحليل الشبكية وتقييم صحة العين. احصل على تشخيص فوري ودقيق للعين من خلال تقنيتنا المتطورة.

source: Start Free Diagnosis
ar: ابدأ التشخيص المجاني

source: Learn More
ar: اعرف المزيد

# aiModels
source: 2 AI Models
ar: نموذجان للذكاء الاصطناعي

source: Retinal & Selfie
ar: الشبكية والسيلفي

source: HIPAA Compliant
ar: متوافق مع HIPAA

source: Secure & Private
ar: آمن وخاص

source: AI-Powered Diagnosis Models
ar: نماذج التشخيص بالذكاء الاصطناعي

# chooseFromAdvancedModels
source: Choose from our advanced AI models for comprehensive eye health analysis
ar: اختر من نماذج الذكاء الاصطناعي المتقدمة لتحليل شامل لصحة العين

source: Retinal Lens
ar: عدسة الشبكية

# selfieCloseUp
source: Selfie Close Up to Eye
ar: سيلفي مقرب للعين

# retinalLensDescription
source: Professional retinal lens imaging for comprehensive eye diagnosis
ar: تصوير احترافي لعدسة الشبكية للتشخيص الشامل للعين

# selfieCloseUpDescription
source: Smartphone-friendly close-up eye screening for quick health assessment
ar: فحص مقرب للعين مناسب للهاتف الذكي للتقييم السريع للصحة

source: Accuracy
ar: الدقة

source: Analysis Time
ar: وقت التحليل

source: Image Type
ar: نوع الصورة

# retinalTime
source: 30-45 seconds
ar: 30-45 ثانية

# selfieTime
source: 15-20 seconds
ar: 15-20 ثانية

source: Retinal Photo
ar: صورة الشبكية

source: Close-up Selfie
ar: سيلفي مقرب

source: Try Retinal Lens
ar: جرب عدسة الشبكية

source: Try Selfie Close Up
ar: جرب السيلفي المقرب

source: Start Analysis
ar: ابدأ التحليل

source: Select Retinal Model
ar: اختر نموذج الشبكية

source: Select External Model
ar: اختر النموذج الخارجي

source: High Accuracy
ar: دقة عالية

source: Fast Results
ar: نتائج سريعة

source: Multiple Conditions
ar: حالات متعددة

source: Language
ar: اللغة

source: Settings
ar: الإعدادات

source: Theme
ar: المظهر

source: Light
ar: فاتح

source: Dark
ar: داكن

source: System
ar: النظام

source: Diagnosis
ar: التشخيص

source: Chat
ar: المحادثة

source: Doctors
ar: الأطباء

source: Find Eye Care Specialists
ar: ابحث عن أخصائيي العناية بالعين

# connectWithQualifiedOphthalmologists
source: Connect with qualified ophthalmologists and eye care professionals in your area. Schedule appointments and get expert care for your eye health.
ar: تواصل مع أطباء العيون المؤهلين وأخصائيي العناية بالعين في منطقتك. احجز المواعيد واحصل على رعاية متخصصة لصحة عينيك.

source: Search by name or specialty...
ar: ابحث بالاسم أو التخصص...

source: Location or ZIP code...
ar: الموقع أو الرمز البريدي...

source: Filter Results
ar: تصفية النتائج

source: Load More Doctors
ar: تحميل المزيد من الأطباء

source: Book Appointment
ar: احجز موعد

source: View Profile
ar: عرض الملف الشخصي

source: reviews
ar: مراجعات

source: miles
ar: ميل

source: Available Today
ar: متاح اليوم

source: Next Available: Tomorrow
ar: المتاح التالي: غداً

source: AI Eye Health Assistant
ar: مساعد صحة العين بالذكاء الاصطناعي

# getInstantAnswers
source: Get instant answers to your eye health questions with voice support
ar: احصل على إجابات فورية لأسئلتك حول صحة العين مع دعم الصوت

source: Eye pain
ar: ألم العين

source: Blurred vision
ar: رؤية ضبابية

source: Red eyes
ar: عيون حمراء

source: Headaches
ar: صداع

# startConversation
source: Start a conversation about your eye health
ar: ابدأ محادثة حول صحة عينيك

source: Stop recording
ar: إيقاف التسجيل

source: Start voice input
ar: بدء الإدخال الصوتي

source: Send message
ar: إرسال رسالة

# pleaseSelectImageAndModel
source: Please select an image and model first
ar: يرجى اختيار صورة ونموذج أولاً

source: Diabetic Retinopathy
ar: اعتلال الشبكية السكري

source: Hypertensive Retinopathy
ar: اعتلال الشبكية الناتج عن ارتفاع ضغط الدم

source: Age-related Macular Degeneration
ar: التنكس البقعي المرتبط بالعمر

source: Glaucoma
ar: الزرق

source: Retinal Detachment
ar: انفصال الشبكية

source: Macular Edema
ar: وذمة البقعة

source: Retinal Vein Occlusion
ar: انسداد الوريد الشبكي

source: Normal Retina
ar: شبكية طبيعية

source: Conjunctivitis
ar: التهاب الملتحمة

source: Dry Eye Syndrome
ar: متلازمة جفاف العين

source: Blepharitis
ar: التهاب الجفن

source: Corneal Abrasion
ar: خدش القرنية

source: Pterygium
ar: الظفرة

source: Cataract
ar: إعتام عدسة العين

source: Normal External Eye
ar: العين الخارجية طبيعية

source: High
ar: عالي

source: Medium
ar: متوسط

source: Low
ar: منخفض

source: Normal
ar: طبيعي

source: Ophthalmologist
ar: طبيب عيون

source: Retinal Specialist
ar: أخصائي الشبكية

source: Corneal Specialist
ar: أخصائي القرنية

source: Retinal Disorders
ar: اضطرابات الشبكية

source: Diabetic Eye Care
ar: رعاية العين السكري

source: Macular Degeneration
ar: التنكس البقعي

source: Corneal Transplant
ar: زراعة القرنية

source: Dry Eye Treatment
ar: علاج جفاف العين

source: Keratoconus
ar: القرنية المخروطية

source: Type your eye health question...
ar: اكتب سؤالك حول صحة العين...

# aboutAppTitle
source: About the App
ar: عن التطبيق

# readMeContent
source: This application uses AI technology to analyze eye images for early detection of eye diseases. You can choose between Retinal Analysis or Selfie Analysis depending on what’s available. Types of Analysis 🔵 Retinal Analysis Requires professional retinal images from medical devices 🟡 Selfie Analysis Uses a close-up selfie of the eye with a smartphone camera Features ⚡ Fast and accurate results 📱 Easy to use on any smartphone 🗺️ Find nearby doctors using the integrated map 🔒 Full privacy for your images and data Important Notes This app is a supportive tool and does not replace a medical diagnosis. If symptoms persist or abnormal results appear, please consult an eye specialist. Our Goal To raise health awareness and enable early detection of eye diseases through AI technology.
ar: هذا التطبيق يستخدم تقنيات الذكاء الاصطناعي لتحليل صور العين بهدف الكشف المبكر عن أمراض العيون. يمكنك اختيار التحليل عبر صور الشبكية (Retina) أو صور السيلفي (Selfie) حسب المتاح لديك. أنواع التحليل 🔵 تحليل الشبكية (Retinal Analysis) يعتمد على صور شبكية مأخوذة من أجهزة طبية متخصصة 🟡 تحليل السيلفي (Selfie Analysis) يعتمد على صورة مقربة للعين باستخدام كاميرا الهاتف المميزات ⚡ نتائج سريعة ودقيقة 📱 سهل الاستخدام من أي هاتف 🗺️ عرض أقرب الأطباء المتخصصين عبر الخريطة 🔒 خصوصية كاملة للصور والبيانات ملاحظات هامة التطبيق أداة مساعدة ولا يغني عن مراجعة الطبيب. في حالة وجود أعراض أو نتائج غير طبيعية، يُفضل استشارة طبيب عيون متخصص. الهدف نهدف إلى تعزيز الوعي الصحي وتمكين المستخدمين من الكشف المبكر عن أمراض العيون عبر الذكاء الاصطناعي.

source: Close
ar: إغلاق

# theAppFeatures
source: App Features
ar: مميزات التطبيق

source: AI-Powered Chat
ar: محادثة الذكاء الاصطناعي

source: Voice Assistant
ar: مساعد صوتي

source: Find Doctors
ar: البحث عن الأطباء

source: Nearby Locations
ar: المواقع القريبة

source: Instant Diagnosis
ar: التشخيص الفوري

source: AI Analysis
ar: التحليل بالذكاء الاصطناعي

source: Multi-Language
ar: متعدد اللغات

source: Arabic & English
ar: العربية والإنجليزية

source: Recording voice note...
ar: تسجيل رسالة صوتية...

source: Tap to stop
ar: اضغط للإيقاف

source: Voice Note
ar: رسالة صوتية

source: Tap to play
ar: اضغط للاستماع

# speechNotClear
source: I heard you, but your message wasn't clear enough. Could you please repeat your eye health question more slowly and clearly?
ar: سمعتك، لكن رسالتك لم تكن واضحة بما فيه الكفاية. هل يمكنك تكرار سؤالك عن صحة العين ببطء أكثر ووضوح؟

# couldNotUnderstand
source: I couldn't understand what you said. Please try speaking more clearly or repeat your message.
ar: لم أفهم ما قلته. يرجى المحاولة بالحديث بوضوح أكثر أو تكرار رسالتك.

# voiceProcessingError
source: Sorry, I'm having trouble processing your voice message. Please try typing your question instead.
ar: عذراً، لدي مشكلة في معالجة رسالتك الصوتية. يرجى محاولة كتابة سؤالك بدلاً من ذلك.
